app/Controllers/Auth.php

    public function authenticate() {
        $usermodel = model('Users_model');

        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $user = $usermodel->where('username', $username)
                          ->where('is_deleted', 0)
                          ->where('role', 'ITSO')
                          ->first();
---
SELECT *
FROM `users`
WHERE `username` = 'lewish'
AND `is_deleted` = 0
AND `role` = 'ITSO'
 LIMIT 1