app/Controllers/Auth.php

    public function authenticate()
    {
        $adminmodel = model('Admins_Model');

        $username = strtolower(trim($this->request->getPost('username')));
        $password = $this->request->getPost('password');

        $user = $adminmodel->where('username', $username)
            ->where('is_deactivated', 0)
            ->whereIn('role', ['admin', 'sadmin'])
            ->first();
---
SELECT *
FROM `admin`
WHERE `username` = 'admin'
AND `is_deactivated` = 0
AND `role` = 'ITSO'
 LIMIT 1