app/Controllers/Equipments.php

    public function index() {
        if (!session()->get('user')) {
            return redirect()->to(base_url('auth/login'));
        }

        $equipmentmodel = model('Equipments_Model');


        $data = array(
            'title' => 'Equipment Dashboard',
            'user' => session()->get('user'),
            'equipments' => $equipmentmodel->where('is_deactivated', 0)->findAll()
        );
---
SELECT *
FROM `equipments`
WHERE `is_deactivated` = 0