app/Controllers/Products.php

SELECT *
FROM `products`
WHERE `is_deleted` = 0
---
    public function index() {
        $productmodel = model('Products_model');

        $data = array(
            'title' => 'Products List',
            'products' => $productmodel->where('is_deleted', 0)->findAll()
        );