app/Controllers/Users.php

SELECT *
FROM `users`
WHERE `users`.`user_id` = '2'
SELECT *
FROM `users`
WHERE `is_deactivated` = 0
---
    public function index() {
        if (!session()->get('user')) {
            return redirect()->to(base_url('auth/login'));
        }

        $usermodel = model('Users_model');
        $userId = session()->get('user')['user_id'];
        $user = $usermodel->find($userId);

        $data = array(
            'title' => 'Users List',
            'user' => $user,
            'users' => $usermodel->where('is_deactivated', 0)->findAll()
        );